-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Jeremy/Documents/GitHub/ECN140-HW6/Final/Problem Set 6.log
  log type:  text
 opened on:   1 Jun 2016, 22:06:38

. do "/Users/Jeremy/Documents/GitHub/ECN140-HW6/Final/Problem Set 6.do"

. // Problem 1
. use "/Users/Jeremy/Documents/GitHub/ECN140-HW6/Datasets/pwt63.dta"

. 
. // Part a
. // Creating Variables
. gen lcons = log(cons)

. gen lrgdp = log(rgdpl)

. 
. // Running regressions
. reg lcons lrgdp, robust

Linear regression                               Number of obs     =         24
                                                F(1, 22)          =    2943.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9904
                                                Root MSE          =     .15065

------------------------------------------------------------------------------
             |               Robust
       lcons |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lrgdp |   .8700202   .0160357    54.26   0.000     .8367642    .9032762
       _cons |   .8343685   .1382019     6.04   0.000     .5477554    1.120982
------------------------------------------------------------------------------

. xi: regress lcons lrgdp i.country, robust
i.country         _Icountry_1-4       (naturally coded; _Icountry_1 omitted)

Linear regression                               Number of obs     =         24
                                                F(4, 19)          =   20763.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9997
                                                Root MSE          =     .03083

------------------------------------------------------------------------------
             |               Robust
       lcons |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lrgdp |   .8834073   .1328143     6.65   0.000     .6054238    1.161391
 _Icountry_2 |  -.2452579   .5195288    -0.47   0.642    -1.332644    .8421284
 _Icountry_3 |   -.271061   .2797988    -0.97   0.345    -.8566867    .3145647
 _Icountry_4 |    .051424   .5444867     0.09   0.926      -1.0882    1.191048
       _cons |   .8296293   .8672313     0.96   0.351    -.9855067    2.644765
------------------------------------------------------------------------------

. 
. // Part c
. xi: regress lcons lrgdp i.country i.year, robust
i.country         _Icountry_1-4       (naturally coded; _Icountry_1 omitted)
i.year            _Iyear_2002-2007    (naturally coded; _Iyear_2002 omitted)

Linear regression                               Number of obs     =         24
                                                F(9, 14)          =   14786.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9998
                                                Root MSE          =     .02853

------------------------------------------------------------------------------
             |               Robust
       lcons |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lrgdp |   .6230649   .2560185     2.43   0.029     .0739598     1.17217
 _Icountry_2 |   .7915908   1.010389     0.78   0.446    -1.375478    2.958659
 _Icountry_3 |    .296603   .5493566     0.54   0.598    -.8816496    1.474856
 _Icountry_4 |   1.137964   1.058431     1.08   0.300    -1.132144    3.408073
 _Iyear_2003 |   .0495838   .0276853     1.79   0.095    -.0097953     .108963
 _Iyear_2004 |   .0479873   .0227662     2.11   0.054    -.0008413    .0968159
 _Iyear_2005 |   .0490033   .0255835     1.92   0.076    -.0058678    .1038745
 _Iyear_2006 |   .0492981    .030295     1.63   0.126    -.0156782    .1142744
 _Iyear_2007 |   .0840769   .0401148     2.10   0.055    -.0019608    .1701147
       _cons |    2.46259   1.645154     1.50   0.157    -1.065914    5.991095
------------------------------------------------------------------------------

. 
. // Problem 2
. use "/Users/Jeremy/Documents/GitHub/ECN140-HW6/Datasets/HW5.DTA", clear

. 
. // Part a: estimating demand equation
. reg p q s

      Source |       SS           df       MS      Number of obs   =       100
-------------+----------------------------------   F(2, 97)        =     35.65
       Model |  17.6530502         2  8.82652511   Prob > F        =    0.0000
    Residual |  24.0168363        97  .247596251   R-squared       =    0.4236
-------------+----------------------------------   Adj R-squared   =    0.4118
       Total |  41.6698865        99  .420907945   Root MSE        =    .49759

------------------------------------------------------------------------------
           p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           q |  -.5240965   .2150125    -2.44   0.017    -.9508367   -.0973563
           s |   .2119044   .0482863     4.39   0.000     .1160696    .3077393
       _cons |   7.188214   2.151711     3.34   0.001     2.917664    11.45876
------------------------------------------------------------------------------

. 
. // Part b: estimating supply equation
. reg q p

      Source |       SS           df       MS      Number of obs   =       100
-------------+----------------------------------   F(1, 98)        =     43.87
       Model |  26.2897166         1  26.2897166   Prob > F        =    0.0000
    Residual |   58.733428        98  .599320694   R-squared       =    0.3092
-------------+----------------------------------   Adj R-squared   =    0.3022
       Total |  85.0231446        99  .858819642   Root MSE        =    .77416

------------------------------------------------------------------------------
           q |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           p |   .7942949   .1199274     6.62   0.000     .5563029    1.032287
       _cons |   8.453962   .2452659    34.47   0.000      7.96724    8.940684
------------------------------------------------------------------------------

. 
. // Part e: instrumental regression
. ivreg q (p = s), first robust

First-stage regressions
-----------------------

      Source |       SS           df       MS      Number of obs   =       100
-------------+----------------------------------   F(1, 98)        =     62.22
       Model |    16.18196         1    16.18196   Prob > F        =    0.0000
    Residual |  25.4879266        98  .260080884   R-squared       =    0.3883
-------------+----------------------------------   Adj R-squared   =    0.3821
       Total |  41.6698865        99  .420907945   Root MSE        =    .50998

------------------------------------------------------------------------------
           p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           s |   .0979731   .0124207     7.89   0.000     .0733247    .1226216
       _cons |   1.944786   .0510009    38.13   0.000     1.843576    2.045995
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression        Number of obs     =        100
                                                F(1, 98)          =      52.54
                                                Prob > F          =     0.0000
                                                R-squared         =          .
                                                Root MSE          =     1.2092

------------------------------------------------------------------------------
             |               Robust
           q |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           p |   2.218834   .3061126     7.25   0.000     1.611364    2.826305
       _cons |   5.689543   .6320685     9.00   0.000     4.435224    6.943862
------------------------------------------------------------------------------
Instrumented:  p
Instruments:   s
------------------------------------------------------------------------------

. 
. // Problem 4
. use "/Users/Jeremy/Documents/GitHub/ECN140-HW6/Datasets/card_minwages.dta", clear

. 
. // part b
. sum emp if state == 1 & year == 1 // NJ before

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         emp |        326    17.06518    8.727993          3         80

. sum emp if state == 1 & year == 2 // NJ after

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         emp |        320    17.57266    8.778737          0       55.5

. sum emp if state == 2 & year == 1 // PA before

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         emp |         78    19.94872    11.67994        4.5       67.5

. sum emp if state == 2 & year == 2 // PA after

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         emp |         77    17.54221    7.909272          0      38.25

. 
. // part c
. reg emp NJ W2 W2NJ

      Source |       SS           df       MS      Number of obs   =       801
-------------+----------------------------------   F(3, 797)       =      2.15
       Model |  524.003099         3    174.6677   Prob > F        =    0.0919
    Residual |  64600.6458       797  81.0547626   R-squared       =    0.0080
-------------+----------------------------------   Adj R-squared   =    0.0043
       Total |  65124.6489       800  81.4058111   Root MSE        =     9.003

------------------------------------------------------------------------------
         emp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          NJ |  -2.883534   1.134812    -2.54   0.011    -5.111107   -.6559608
          W2 |   -2.40651   1.446314    -1.66   0.097    -5.245544    .4325237
        W2NJ |   2.913982   1.610513     1.81   0.071    -.2473667    6.075331
       _cons |   19.94872   1.019394    19.57   0.000      17.9477    21.94973
------------------------------------------------------------------------------

. 
. // Problem 5
. use "/Users/Jeremy/Documents/GitHub/ECN140-HW6/Datasets/INJURY.DTA", clear

. 
. // part b
. sum durat if highearn == 1 & afchnge == 0 // High earners before

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       durat |      1,472    11.76155    30.01366        .25        182

. sum durat if highearn == 1 & afchnge == 1 // high earners after

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       durat |      1,380    13.93152    30.39186        .25        182

. sum durat if highearn == 0 & afchnge == 0 // low earners before

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       durat |      2,294    7.475044    17.25335        .25        182

. sum durat if highearn == 0 & afchnge == 1 // low earners after

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       durat |      2,004    8.611527     21.9445        .25        182

. 
. // part c
. reg durat highearn afchnge afhigh

      Source |       SS           df       MS      Number of obs   =     7,150
-------------+----------------------------------   F(3, 7146)      =     24.88
       Model |  44343.4979         3   14781.166   Prob > F        =    0.0000
    Residual |  4245982.66     7,146  594.176136   R-squared       =    0.0103
-------------+----------------------------------   Adj R-squared   =    0.0099
       Total |  4290326.16     7,149  600.129551   Root MSE        =    24.376

------------------------------------------------------------------------------
       durat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    highearn |   4.286505   .8140426     5.27   0.000     2.690741     5.88227
     afchnge |   1.136483   .7453242     1.52   0.127    -.3245728    2.597539
      afhigh |   1.033489   1.178865     0.88   0.381    -1.277435    3.344414
       _cons |   7.475044   .5089333    14.69   0.000     6.477384    8.472704
------------------------------------------------------------------------------

. 
. 
end of do-file

. log close
      name:  <unnamed>
       log:  /Users/Jeremy/Documents/GitHub/ECN140-HW6/Final/Problem Set 6.log
  log type:  text
 closed on:   1 Jun 2016, 22:06:47
-----------------------------------------------------------------------------------------
